In [1]:
import numpy as np
import pandas as pd

##What Null/NA/nan objects look like:
A new pd.NA value (singleton) is introduced to represent scalar missing values. Up to now, pandas used several values to represent missing data: np.nan is used for this for float data, np.nan or None for object-dtype data and pd.NaT for datetime-like data. The goal of pd.NA is to provide a “missing” indicator that can be used consistently across data types. pd.NA is currently used by the nullable integer and boolean data types and the new string data type

In [3]:
np.nan

nan

In [6]:
pd.NA

In [7]:
np.nan==pd.NA

In [8]:
np.nan == np.nan

False

In [9]:
np.nan in [np.nan]

True

In [10]:
np.nan is np.nan

True

In [11]:
pd.NA == pd.NA

In [12]:


df = pd.DataFrame({'team': ['A', 'A', 'A', 'NaN', 'B', 'NaN', 'B', 'B'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [13]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [15]:
df.isnull()

    team  points  assists
A  False   False    False
B  False   False    False
C  False   False    False
D  False   False    False
E  False   False    False
F  False   False    False
G  False   False    False
H  False   False    False

In [16]:
df.notnull()

   team  points  assists
A  True    True     True
B  True    True     True
C  True    True     True
D  True    True     True
E  True    True     True
F  True    True     True
G  True    True     True
H  True    True     True

In [17]:
df[df['team'].isnull()]

Empty DataFrame
Columns: [team, points, assists]
Index: []

In [19]:
df[(df['team'].isnull())&df['points'].notnull()]

Empty DataFrame
Columns: [team, points, assists]
Index: []

                            ###Drop Data

In [20]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [22]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis: 'Axis' = 0, how: 'str' = 'any', thresh=None, subset=None, inplace: 'bool' = False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [23]:
df.dropna()

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [ ]:

df = pd.DataFrame({'team': ['A', 'A', 'A', NaN, 'B', NaN, 'B', 'B'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [24]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [25]:
df.dropna

<bound method DataFrame.dropna of   team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12>

In [26]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [30]:
df = pd.DataFrame({'team': ['A', 'A', 'A', NaN, 'B', NaN, 'B', 'B'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

NameError: name 'NaN' is not defined

In [31]:
df.dropna(thresh=1)

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [32]:
df.dropna(axis=1)

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [33]:
df.dropna(thresh=4,axis=1)

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

                        ####Fill Data

In [34]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [35]:
df.fillna("NEW VALUE!")

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D  NaN       9        6
E    B      12        6
F  NaN       9        5
G    B       9        9
H    B       4       12

In [47]:
df = pd.DataFrame({'team': ['A', 'A', 'A', np.nan, 'B', 'B', 'B', 'B'],
                   'points': [np.nan, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [48]:
df

  team  points  assists
A    A     NaN       11
B    A     7.0        8
C    A     7.0       10
D  NaN     9.0        6
E    B    12.0        6
F    B     9.0        5
G    B     9.0        9
H    B     4.0       12

In [49]:
df = pd.DataFrame({'team': ['A', 'A', 'A', np.nan, 'B', 'B', 'B', 'B'],
                   'points': [np.nan, np.nan, np.nan,np.nan , np.nan, np.nan, np.nan, np.nan],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [50]:
df

  team  points  assists
A    A     NaN       11
B    A     NaN        8
C    A     NaN       10
D  NaN     NaN        6
E    B     NaN        6
F    B     NaN        5
G    B     NaN        9
H    B     NaN       12

In [51]:
df.dropna()

Empty DataFrame
Columns: [team, points, assists]
Index: []

In [52]:
df

  team  points  assists
A    A     NaN       11
B    A     NaN        8
C    A     NaN       10
D  NaN     NaN        6
E    B     NaN        6
F    B     NaN        5
G    B     NaN        9
H    B     NaN       12

In [53]:
df.dropna()

Empty DataFrame
Columns: [team, points, assists]
Index: []

In [54]:
df.dropna(thresh=1)

  team  points  assists
A    A     NaN       11
B    A     NaN        8
C    A     NaN       10
D  NaN     NaN        6
E    B     NaN        6
F    B     NaN        5
G    B     NaN        9
H    B     NaN       12

In [55]:
df.dropna(axis=1)

   assists
A       11
B        8
C       10
D        6
E        6
F        5
G        9
H       12

In [56]:
df.dropna(thresh=4,axis=1)

  team  assists
A    A       11
B    A        8
C    A       10
D  NaN        6
E    B        6
F    B        5
G    B        9
H    B       12

In [57]:
df.fillna("NEW VALUE!")

         team      points  assists
A           A  NEW VALUE!       11
B           A  NEW VALUE!        8
C           A  NEW VALUE!       10
D  NEW VALUE!  NEW VALUE!        6
E           B  NEW VALUE!        6
F           B  NEW VALUE!        5
G           B  NEW VALUE!        9
H           B  NEW VALUE!       12

In [58]:
df['team'].fillna("Empty")

A        A
B        A
C        A
D    Empty
E        B
F        B
G        B
H        B
Name: team, dtype: object

In [59]:
df['team'] = df['team'].fillna("Empty")

In [60]:
df

    team  points  assists
A      A     NaN       11
B      A     NaN        8
C      A     NaN       10
D  Empty     NaN        6
E      B     NaN        6
F      B     NaN        5
G      B     NaN        9
H      B     NaN       12

In [61]:
df['points'].mean()

nan

In [63]:
df['points'].fillna(df['points'].meran())

AttributeError: 'Series' object has no attribute 'meran'

In [64]:
df['points'].fillna(df['points'].mean())

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
F   NaN
G   NaN
H   NaN
Name: points, dtype: float64

Filling with Interpolation

Be careful with this technique, you should try to really understand whether or not this is a valid choice for your data. You should also note there are several methods available, the default is a linear method

In [72]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}
import pandas as pd

In [73]:
ser = pd.Series(airline_tix)

In [74]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [75]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

In [76]:
ser.interpolate(method='spline')

ValueError: Index column must be numeric or datetime type when using spline method other than linear. Try setting a numeric or datetime index column before interpolating.

In [77]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

In [78]:
df = pd.DataFrame(ser,columns=['Price'])
df

              Price
first         100.0
business        NaN
economy-plus   50.0
economy        30.0

In [79]:
df = df.reset_index()

In [80]:
df

          index  Price
0         first  100.0
1      business    NaN
2  economy-plus   50.0
3       economy   30.0

In [ ]:
=